[{
  "news_items": [
    {
      "title": "Hull and East Yorkshire Combined Authority to begin work",
      "description": "The long-awaited Hull and East Yorkshire Combined Authority can now officially begin its work after the final steps were taken by the Government to create the new body.",
      "image_url": "//www.hull.gov.uk/images/HEYCA_headers.jpg",
      "link_url": "https://www.hullandeastyorkshire.gov.uk/news/article/11/hull-and-east-yorkshire-combined-authority-to-begin-work"
    },
    {
      "title": "Proposed memorial gardens",
      "description": "Hull City Council and East Riding of Yorkshire Council have committed to providing permanent memorials to those involved in the Legacy Funeral Director investigation. Access the plans and give your thoughts on the designs through our survey..",
      "image_url": "//www.hull.gov.uk/images/Legacy_banner.jpg",
      "link_url": "https://yoursay.hull.gov.uk/proposed-memorial-gardens"
    },
    {
      "title": "Engagement with residents and businesses about safety improvements to Lowgate",
      "description": "We have launched a six-week engagement exercise to provide information and seek feedback from the public and other stakeholders about a series of changes to improve road safety in the Lowgate area of the city centre.",
      "image_url": "//www.hull.gov.uk/images/Lowgate_1_777x437.jpeg",
      "link_url": "https://news.hull.gov.uk/06/02/2025/council-to-engage-with-residents-and-businesses-about-safety-improvements-to-lowgate/"
    },
    {
      "title": "Become part of the Independent Remuneration Panel",
      "description": "Help us review our Councillors’ Allowance Scheme to ensure that we are effective in our financial reporting, internal controls, governance and risk management. We are looking for an independent individual to help us as either an Independent Remuneration Panel member or an Independent member of the Audit Committee.",
      "image_url": "//www.hull.gov.uk/images/Why_HCC_tile_640x427_1_1.jpg",
      "link_url": "https://www.workingforhullcitycouncil.org.uk/careers-hull-city-council-1/independent-remuneration-panel"
    }
  ]
}]